app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT "carts".* FROM "carts"

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "pppppp"], ["description", nil], ["price", nil], ["created_at", "2022-04-01 12:13:55.413170"], ["updated_at", "2022-04-01 12:13:55.413170"]]

  def update
    respond_to do |format|
      if @cart.update(cart_params)
---
UPDATE "carts" SET "updated_at" = $1 WHERE "carts"."id" = $2  [["updated_at", "2022-04-02 14:11:04.401914"], ["id", 15]]

  def destroy
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 14]]

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]